tutorials/mesh/foamyHexMesh/mixerVessel/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

shaftRotating.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       100;

    subsetFeatures
    {
        // Remove the top feature
        insideBox       (-0.1 -0.1 -0.1)(0.1 0.1 0.1);
    }

    // Write options
    writeObj            yes;
}


vessel.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       120;

    subsetFeatures
    {
        // Keep nonManifold edges (edges with >2 connected faces where
        // the faces form more than two different normal planes)
        nonManifoldEdges    no;

        // Keep open edges (edges with 1 connected face)
        openEdges           no;
    }

    // Write options
    writeObj            no;
}


spargerInlet.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       120;

    // Write options
    writeObj            no;
}


stirrer.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       120;

    // Write options
    writeObj            no;
}


stirrer_baffles.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       120;

    baffles (stirrer);

    // Write options
    writeObj            no;
}


rotating.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       120;

    baffles (rotating);

    // Write options
    writeObj            yes;
}


baffles.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       120;

    baffles (baffles);

    // Write options
    writeObj            no;
}


// ************************************************************************* //
